---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Analysis.EnergyAnalysisWindowType
source: html/8394c324-e7bd-886e-ce87-d336d4766458.htm
---
# EnergyAnalysisWindowType Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.